---
type: ReferencePoint
namespace: Autodesk.Revit.DB
version: 2024
members: 17
tags: [revit-api, class]
---

# ReferencePoint

`Autodesk.Revit.DB.ReferencePoint` · Revit 2024 · 17 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetCoordinatePlaneReferenceXY | — | `public Reference GetCoordinatePlaneReferenceXY ()` |
| Method | GetCoordinatePlaneReferenceXZ | — | `public Reference GetCoordinatePlaneReferenceXZ ()` |
| Method | GetCoordinatePlaneReferenceYZ | — | `public Reference GetCoordinatePlaneReferenceYZ ()` |
| Method | GetCoordinateSystem | — | `public Transform GetCoordinateSystem ()` |
| Method | GetHubId | — | `public ElementId GetHubId ()` |
| Method | GetInterpolatingCurves | — | `public CurveByPointsArray GetInterpolatingCurves ()` |
| Method | GetPointElementReference | — | `public PointElementReference GetPointElementReference ()` |
| Method | GetVisibility | — | `public FamilyElementVisibility GetVisibility ()` |
| Method | SetCoordinateSystem | — | `public void SetCoordinateSystem ( Transform coordinateSystem )` |
| Method | SetPointElementReference | — | `public void SetPointElementReference ( PointElementReference pointElementReference )` |
| Method | SetVisibility | — | `public void SetVisibility ( FamilyElementVisibility visibility )` |
| Property | CoordinatePlaneVisibility | — | `public CoordinatePlaneVisibility CoordinatePlaneVisibility { get ; set ; }` |
| Property | Name | — | `public override string Name { get ; set ; }` |
| Property | Parameter | — | `` |
| Property | Position | — | `public XYZ Position { get ; set ; }` |
| Property | ShowNormalReferencePlaneOnly | — | `public bool ShowNormalReferencePlaneOnly { get ; set ; }` |
| Property | Visible | — | `public bool Visible { get ; set ; }` |